# Conhecendo melhor nossa base de consumidores: qual estado possui os clientes com melhores pontuações de crédito?

## Objetivo

Queremos conhecer melhor nossos clientes por estado. Para isso, iniciamos uma análise na pontuação de crédito. 
Para realizar a verificação inicial, precisamos de alguns valores.
Os valores são a média, a mediana, a moda e o desvio padrão da pontuação de crédito.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('desafio1.csv')

In [5]:
df.head()

,RowNumber,id,sobrenome,pontuacao_credito,estado_residencia,genero,idade,nivel_estabilidade,saldo_conta,numero_produtos,possui_cartao_de_credito,membro_ativo
0,1,e7f44fcbd380d4cef7e6c232cc7e37895c3fd197,6d6e0aa1b9b413e442e2fb68df14b4fc3f91de50,619,SC,F,42,2,0.00,1,1,1
1,2,28dcb083ad90512da16b9430085c2cddb8ca5e12,48e1ad846796fa314f1b4a6702b83343eb5482c5,608,RS,F,41,1,83807.86,1,0,1
2,3,774bc378f787438c9c7594e536787d07a097a54b,f2b29d5d934de615812b697132e767dea0f1e9e2,502,SC,F,42,8,159660.80,3,1,0
3,4,043a71326f7096de155e7f0c559dc62b5e4b7239,85d5c9da7cddd8109ad32a6c348fe2bb10bf99f2,699,SC,F,39,1,0.00,2,0,0
4,5,37b3bb8ca243955fb3605ec7e1c2a4607cdb3b22,ddc89c837a6933639de75f28171057060bd322df,850,RS,F,43,2,125510.82,1,1,1

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7000 entries, 0 to 6999
Data columns (total 12 columns):
RowNumber                   7000 non-null int64
id                          7000 non-null object
sobrenome                   7000 non-null object
pontuacao_credito           7000 non-null int64
estado_residencia           7000 non-null object
genero                      7000 non-null object
idade                       7000 non-null int64
nivel_estabilidade          7000 non-null int64
saldo_conta                 7000 non-null float64
numero_produtos             7000 non-null int64
possui_cartao_de_credito    7000 non-null int64
membro_ativo                7000 non-null int64
dtypes: float64(1), int64(7), object(4)
memory usage: 656.4+ KB

In [8]:
df.shape

(7000, 12)

In [9]:
df.isna().sum()

RowNumber                   0
id                          0
sobrenome                   0
pontuacao_credito           0
estado_residencia           0
genero                      0
idade                       0
nivel_estabilidade          0
saldo_conta                 0
numero_produtos             0
possui_cartao_de_credito    0
membro_ativo                0
dtype: int64

In [15]:
media = df.groupby(by='estado_residencia')['pontuacao_credito'].mean()
media = media.reset_index()

In [16]:
media

  estado_residencia  pontuacao_credito
0                PR         648.961294
1                RS         651.105143
2                SC         649.537653

In [17]:
medn = df.groupby(by='estado_residencia')['pontuacao_credito'].median()
medn = medn.reset_index()

In [18]:
medn

  estado_residencia  pontuacao_credito
0                PR                650
1                RS                650
2                SC                653

In [42]:
moda = df.groupby(by='estado_residencia')['pontuacao_credito'].agg(lambda x: x.mode()[0])
moda = moda.reset_index()

In [43]:
moda

  estado_residencia  pontuacao_credito
0                PR                850
1                RS                850
2                SC                850

In [36]:
devpad = df.groupby(by='estado_residencia')['pontuacao_credito'].std()
devpad = devpad.reset_index()

In [37]:
devpad

  estado_residencia  pontuacao_credito
0                PR          98.607186
1                RS          95.136598
2                SC          97.233493